# Задание с числами
y = float(input("ведите число y:"))
x = float(input("введите число x:"))
print(y+x)
print(y-x)
print(y/x)
print(y*x)
print(y**x)

# Создайте новый проект в интегрированной среде разработки PyCharm. Создайте файл исходного кода и напишите программу,
# которая выводит ваше имя. Запустите его. Создайте второй файл с кодом и напишите программу, которая спрашивает у
# пользователя, как его зовут, и здоровается с ним. Запустите его. Переключитесь на первый скрипт и запустите его.
# Переключитесь обратно на второй скрипт.

name = input("Экак вас зовут?")
print("Здравствуйте",name,"!")
