# Завдання 1
# Прочитайте у документації з мови Python інформацію про перелічені у резюме цього уроку стандартні функції.
# Перевірте їх на практиці.

# a = 4
# b = 5
# c = 45
# d = -1
# print(min(a, b, c, d))
# print(max(a, b, c, d))
#
# for i in reversed(range(7)):
#     print(i)

# Завдання 2
# Створіть програму, яка перевіряє, чи є паліндромом введена фраза.

# a = input("Ведіть слово для перевірки")
# rev = ""
# for i in a:
#     rev += i
# if a == rev:
#     print("слово", a, "є паліндромом")
# else:
#     print("слово", a, "не є паліндромом")


# Завдання 3
# Нехай на кожну сходинку можна стати з попередньої або переступивши через одну.
# Визначте, скількома способами можна піднятися на задану сходинку.

def stairs(n):
    res = [1]
    if n >= 2:
        res.append(2)
    for i in range(2, n):
        res.append(res[i - 1] + res[i - 2])
    return res[n - 1]
print(stairs(10))









# Задание 4
# Напишите рекурсивную функцию, которая вычисляет сумму натуральных чисел, которые входят в заданный промежуток.
# def fun(a, b, sum = 0):
#     if a > b:
#         return sum
#     else:
#         sum += a
#         a += 1
#         return fun(a, b, sum)
# print("Сума числен =", fun(5, 10))




