# Задание 1
# Даны числа a и b (a < b). Выведите сумму всех натуральных чисел от a до b (включительно).


# a = int(input("ведіть 1 будь-яке число a :"))
# b = int(input("ведіть 2 будь-яке числа b (a<b):"))
# x = 0
# for x in range(a, b+1, 1):
#     if x > 0:
#         print(x)


# Задание 2
#
# Факториалом числа n называется число 𝑛! = 1 ∙ 2 ∙ 3 ∙ … ∙ 𝑛.
# Создайте программу, которая вычисляет факториал введённого пользователем числа.

# 1
# import math
# f = int(input("ведіть число факторіал якого ви хочете знайти:"))
# a = math.factorial(f)
# print(a)

# # 2
# f = int(input("ведіть число факторіал якого ви хочете знайти:"))
# x = 1
# for y in range(1, f+1):
#     x *= y
#     print(x)


# Задание 3
#
# Используя вложенные циклы и функции print(‘*’, end=’’), print(‘ ‘, end=’’) и print()
# выведите на экран прямоугольный треугольник
# for i in range(10):
#     print("*" * i, end="\n")


# Задание 4
# Создайте программу, которая рисует на экране прямоугольник из звёздочек заданной пользователем ширины и высоты.


# a = int(input("ведіть сторону а"))
# b = int(input("ведіть сторону b"))
# for x in range(a):
#     for y in range(b):
#         print('*', end='')
#     print()





